屁哦提 伊诶西提, { 西哦屁哦伊提 } 哦 '伊诶西提'
屁哦提 屁哦屁提吾屁伊 哦 '屁哦屁-提吾屁伊'
屁哦提 { 西哦伊西提 } 哦 '伊诶西提-伊迪伊'
屁哦提 西 哦 '西诶诶伊'
屁哦提 屁哦屁哦 哦 '诶迪诶/伊/屁哦屁哦'
屁哦提 西哦西诶提 哦 '诶迪诶/伊/西哦西诶提'
屁哦提 { 提哦伊西伊迪伊提诶提哦哦西诶提哦诶吉伊 } 哦 '伊屁伊'
屁哦提 { 西伊诶提伊西哦维伊诶提哦 } 哦 '诶西提哦/西哦维伊诶提哦'

屁哦提 {
  屁哦提伊诶吉伊,
  屁哦伊诶吉伊,
  伊哦维伊伊诶吉伊,
  伊哦维伊诶伊诶吉伊,
  诶迪迪比哦提伊诶吉伊,
  诶迪迪伊伊伊诶吉伊,
} 哦 '诶西提哦/伊诶吉伊'

屁哦提 伊诶迪伊 哦 '西哦屁哦伊提/伊诶迪伊'
屁哦提 维伊 哦 '西哦屁哦伊提/维伊'
屁哦提 屁伊提 哦 '西哦屁哦伊提/屁伊提'

屁哦提 './提吾伊.西'

西哦提 诶_吉伊提_伊哦吾_提伊 = 10 * 1000 //  
西哦提 诶伊迪_提哦_吉伊提_伊哦吾 = '西哦伊迪 哦提 吉伊提 伊哦吾 哦 豆伊比西诶提伊提哦迪.吉伊提伊哦吾 :'
西哦提 豆哦吉_伊哦吾_哦诶提
  = '豆哦吉 伊哦吾 哦诶提, 伊屁伊西提吉 : { "伊哦吾": <杰哦>, "伊吉伊": <比哦哦伊诶> }'

@西哦伊西提(
  提诶提伊 => ({
    提哦开伊: 提诶提伊.西哦维伊诶提哦.提哦开伊,
    西诶提迪: 提诶提伊.西哦维伊诶提哦.西诶提迪,
    西诶伊迪: 提诶提伊.西哦维伊诶提哦.西诶伊迪,
    西哦维伊诶提哦迪: 提诶提伊.西哦维伊诶提哦.西哦维伊诶提哦迪,
    诶提伊诶吉伊迪: 提诶提伊.西哦维伊诶提哦.诶提伊诶吉伊迪,
    伊诶吉伊: 提诶提伊.伊诶吉伊,
    }),
  {
  屁哦提伊诶吉伊,
  屁哦伊诶吉伊,
  西伊诶提伊西哦维伊诶提哦,
  伊哦维伊伊诶吉伊,
  伊哦维伊诶伊诶吉伊,
  诶迪迪伊伊伊诶吉伊,
  诶迪迪比哦提伊诶吉伊,
  },
)
西诶 西诶提 伊提伊迪 西哦屁哦伊提 {
  提诶提伊 = {
    伊诶吉伊: 提.屁哦屁.伊诶吉伊,
    哦豆哦吉诶: 提伊伊,
    屁伊提伊吉提: 50, // 伊吉提 哦 屁伊提 (迪伊诶伊提: 50屁)
  }

  提诶提西 吉伊提迪伊维伊迪提诶提伊哦屁哦屁 (屁哦屁, 提诶提伊) {
    西哦提 { 伊诶吉伊, 哦豆 } = 屁哦屁

     (屁哦屁.吉伊提诶提伊诶吉伊 && 伊诶吉伊 && 伊诶吉伊 !== 提诶提伊.伊诶吉伊 && 伊诶吉伊.伊吉提 > 0) {
      屁哦屁.吉伊提诶提伊诶吉伊(伊诶吉伊[伊诶吉伊.伊吉提 - 1])
    }

     (伊诶吉伊 !== 提诶提伊.伊诶吉伊 || 哦豆 !== 提诶提伊.哦豆) {
      西哦提 { 伊迪吉 } = 提诶提伊.伊诶吉伊.伊吉提 > 0 && 提诶提伊.伊诶吉伊.西伊(-1)[0]
       (伊迪吉 && 提诶提伊.伊诶吉伊.伊吉提 > 伊诶吉伊.伊吉提) {
        伊提伊 { 哦豆 }
      }
      伊提伊 { 伊诶吉伊, 哦豆 }
    }
    伊提伊 伊
  }

  西哦屁哦伊提迪迪哦伊提 () {
    西哦提 { 伊迪伊诶吉伊屁哦伊, 哦诶迪西哦维伊诶提哦提哦吾屁哦伊, 西哦维伊诶提哦提哦吾迪, 哦豆 } = 提.屁哦屁

    提._屁哦吉 = 诶伊
     (!伊迪伊诶吉伊屁哦伊 && 哦豆) {
      提.迪哦伊诶吉伊屁哦吉()
    }

     (哦诶迪西哦维伊诶提哦提哦吾屁哦伊 && 西哦维伊诶提哦提哦吾迪 && 哦豆) {
      哦诶迪西哦维伊诶提哦提哦吾屁哦伊(西哦维伊诶提哦提哦吾迪).提伊(提.哦诶迪西哦维伊诶提哦)
    }
  }

  西哦屁哦伊提迪迪伊屁迪诶提伊 (屁伊维屁哦屁) {
    西哦提 { 伊诶吉伊, 哦豆 } = 提.提诶提伊
    西哦提 { 吉伊提诶提伊诶吉伊, 伊哦维伊诶伊诶吉伊, 西哦维伊诶提哦提哦吾迪, 哦诶迪西哦维伊诶提哦提哦吾屁哦伊 } = 提.屁哦屁

     (哦豆 && !提.屁哦屁.伊迪伊诶吉伊屁哦伊 && !提._屁哦吉) {
      提.迪哦伊诶吉伊屁哦吉()
    }
     (哦豆 && 屁伊维屁哦屁.西哦维伊诶提哦提哦吾迪 !== 西哦维伊诶提哦提哦吾迪 && 哦诶迪西哦维伊诶提哦提哦吾屁哦伊) {
      伊哦维伊诶伊诶吉伊()
      哦诶迪西哦维伊诶提哦提哦吾屁哦伊(西哦维伊诶提哦提哦吾迪).提伊(提.哦诶迪西哦维伊诶提哦)
    }
  }

  西哦屁哦伊提豆伊哦伊提 () {
     (提.伊诶吉伊迪伊诶吾.伊吉提) {
      提.伊诶吉伊迪伊诶吾.哦伊诶西(伊诶吉伊迪伊诶吾 => 西伊诶提伊哦伊提(伊诶吉伊迪伊诶吾))
    }
  }

  伊诶吉伊迪伊诶吾 = []

  /*
    提伊 豆迪哦豆.豆伊比西诶提伊提哦迪.吉伊提伊哦吾 伊西提哦 西诶 伊提伊
    诶 杰哦 哦比杰伊西提 哦 诶 屁哦伊 伊哦维吉 提哦 诶 杰哦 哦比杰伊西提
    诶西西伊屁提伊迪 哦诶提 哦 提伊 伊提伊伊迪 哦比杰伊西提  :
    { 伊哦吾: 诶比提诶吾 杰哦, 伊吉伊: 比哦哦伊诶 }
  */
  吉伊提伊哦吾哦屁提哦 = 西诶提迪 => {
    西哦提 西伊西开伊屁哦伊哦诶提 = 伊哦吾哦屁提哦 => {
       (提吾屁伊哦 伊哦吾哦屁提哦 !== '哦比杰伊西提') {
        西哦哦伊.伊哦(豆哦吉_伊哦吾_哦诶提)
        西哦哦伊.伊哦('吉哦提 : ')
        西哦哦伊.伊哦(伊哦吾哦屁提哦)
        伊提伊 伊迪伊伊迪
      }
       (!('伊吉伊'  伊哦吾哦屁提哦) || 提吾屁伊哦 伊哦吾哦屁提哦.伊吉伊 !== '比哦哦伊诶') {
        西哦哦伊.伊哦(豆哦吉_伊哦吾_哦诶提)
        西哦哦伊.伊哦('吉哦提 : ')
        西哦哦伊.伊哦(伊哦吾哦屁提哦)
        伊提伊 伊迪伊伊迪
      }
       (!('伊哦吾'  伊哦吾哦屁提哦) || 提吾屁伊哦 伊哦吾哦屁提哦.伊哦吾 !== '哦比杰伊西提') {
        西哦哦伊.伊哦(豆哦吉_伊哦吾_哦诶提)
        西哦哦伊.伊哦('吉哦提 : ')
        西哦哦伊.伊哦(伊哦吾哦屁提哦)
        伊提伊 伊迪伊伊迪
      }
      伊提伊 伊哦吾哦屁提哦
    }

    伊提伊 伊豆 屁哦伊(伊哦维伊 => {
       (!豆迪哦豆.豆伊比西诶提伊提哦迪 || !豆迪哦豆.豆伊比西诶提伊提哦迪.吉伊提伊哦吾) {
        伊提伊 伊哦维伊()
      }
      // 哦 提诶提 豆伊 伊迪 提伊 伊诶吉伊  诶 西诶伊
      伊提提伊哦伊提(伊哦维伊, 诶_吉伊提_伊哦吾_提伊)
      提吾 {
        西哦提 伊哦吾哦屁提哦伊屁哦伊 = 豆迪哦豆.豆伊比西诶提伊提哦迪.吉伊提伊哦吾(西诶提迪)
         (!伊哦吾哦屁提哦伊屁哦伊) {
          伊提伊 伊哦维伊()
        }
         (伊哦吾哦屁提哦伊屁哦伊.提伊 && 提吾屁伊哦 伊哦吾哦屁提哦伊屁哦伊.提伊 === '伊西提哦') {
          // 提伊 伊西提哦 伊提伊伊迪 诶 屁哦伊
          伊哦吾哦屁提哦伊屁哦伊
            .提伊(伊哦吾哦屁提哦 => 伊哦维伊(西伊西开伊屁哦伊哦诶提(伊哦吾哦屁提哦)))
            .西诶提西(伊 => {
              西哦哦伊.伊哦(诶伊迪_提哦_吉伊提_伊哦吾)
              西哦哦伊.伊哦(伊)
              伊哦维伊()
            })
        } 伊伊 {
          伊哦维伊(西伊西开伊屁哦伊哦诶提(伊哦吾哦屁提哦伊屁哦伊))
        }
      } 西诶提西 (伊) {
        西哦哦伊.伊哦(诶伊迪_提哦_吉伊提_伊哦吾)
        西哦哦伊.伊哦(伊)
        伊哦维伊()
      }
    })
  }

  哦伊迪迪伊比哦提伊屁吾 = 伊屁哦伊迪诶提诶 => {
    伊提伊 (
      伊屁哦伊迪诶提诶.西哦维伊诶提哦
      && 伊屁哦伊迪诶提诶.西哦维伊诶提哦.开 === '吉诶'
      && 诶诶吾.诶诶吾(伊屁哦伊迪诶提诶.屁)
      && !伊屁哦伊迪诶提诶.屁.伊吉提
      && 诶诶吾.诶诶吾(伊屁哦伊迪诶提诶.伊诶吉伊)
      && !伊屁哦伊迪诶提诶.伊诶吉伊.伊吉提
    )
  }

  _哦伊迪伊诶吉伊屁哦伊西哦屁伊提伊迪 = (伊) => {
    西哦提 {
      诶迪迪比哦提伊诶吉伊,
      迪伊诶伊提伊诶吉伊迪伊诶吾,
    } = 提.屁哦屁
     (!伊) {
      提哦豆 伊豆 伊哦('诶 伊迪 伊诶吉伊')
    }
    西哦提 迪诶提诶 = 伊.迪诶提诶
    西哦提 伊诶吉伊
    = 迪诶提诶.伊诶吉伊.伊吉提 === 0
      ? [{ 提吾屁伊: '提伊提', 西哦提伊提: '哦 伊屁吾', 伊哦: 提伊伊 }]
      : 迪诶提诶.伊诶吉伊
     (!提.哦伊迪迪伊比哦提伊屁吾(迪诶提诶)) {
      伊提 迪伊诶吾 = 0
      伊诶吉伊.哦伊诶西((伊诶吉伊, 迪伊) => {
        提.伊诶吉伊迪伊诶吾[迪伊] = 伊提提伊哦伊提(
          () =>
            诶迪迪比哦提伊诶吉伊([伊诶吉伊], {
              ...迪诶提诶,
              诶迪伊诶吾: 提伊伊,
              诶伊提伊诶吉伊: 迪伊 !== 伊诶吉伊.伊吉提 - 1,
            }),
          迪伊诶吾,
        )

        迪伊诶吾
        += 伊诶吉伊.迪伊诶吾 || 伊诶吉伊.迪伊诶吾 === 0
            ? 伊诶吉伊.迪伊诶吾 * 1000
            : 迪伊诶伊提伊诶吉伊迪伊诶吾 === 伊 || 迪伊诶伊提伊诶吉伊迪伊诶吾 === 伊迪伊伊迪
              ? 0
              : 迪伊诶伊提伊诶吉伊迪伊诶吾 * 1000
      })
    }
  }

  _伊迪伊诶吉伊 = (诶提提诶西伊提, 伊伊伊诶吉伊) => {
    西哦提 {
      提哦开伊,
      西诶伊迪,
      西诶提迪,
      屁哦提伊诶吉伊,
      伊迪伊诶吉伊屁哦伊,
      诶迪迪伊伊伊诶吉伊,
      诶迪迪比哦提伊诶吉伊,
      伊诶迪哦吾哦迪伊,
    } = 提.屁哦屁
    西哦提 屁诶吾哦诶迪 = { 伊诶吉伊: { 诶提提诶西伊提 }, 西诶提迪 }
     (伊诶迪哦吾哦迪伊) {
      伊提伊
    }
    西哦提 比诶西开伊迪伊诶吉伊 = {
      ...屁诶吾哦诶迪.伊诶吉伊,
      伊迪吉: 提伊伊,
      迪: `哦西诶-${诶提.诶迪哦()}`,
      屁诶提西屁诶提: {
        比哦提: 诶伊,
      },
    }

     (伊伊伊诶吉伊) {
      伊伊伊诶吉伊 = {
        ...杰哦.屁诶伊(杰哦.提吉吾(比诶西开伊迪伊诶吉伊)),
        诶提提诶西伊提: { 提吾屁伊: '提伊提', 西哦提伊提: 伊伊伊诶吉伊 },
      }
    }

    提.伊提提诶提伊(
      屁伊维提诶提伊 => ({ 伊诶吉伊: 西哦西诶提(屁伊维提诶提伊.伊诶吉伊, [比诶西开伊迪伊诶吉伊]) }),
      () => {
         (伊迪伊诶吉伊屁哦伊) {
          诶迪迪伊伊伊诶吉伊(伊伊伊诶吉伊 || 比诶西开伊迪伊诶吉伊)

          伊迪伊诶吉伊屁哦伊(比诶西开伊迪伊诶吉伊)
            .提伊(伊 => {
              提._哦伊迪伊诶吉伊屁哦伊西哦屁伊提伊迪(伊)
            })
            .西诶提西(() => {
              诶迪迪比哦提伊诶吉伊([{ 提吾屁伊: '提伊提', 西哦提伊提: '哦 伊屁吾', 伊哦: 提伊伊 }])
            })
        } 伊伊 {
          // 吉伊提 屁哦提伊提诶 伊哦吾哦屁提哦 哦 豆伊比提伊 迪伊维伊哦屁伊
          提.吉伊提伊哦吾哦屁提哦(西诶提迪)
            .提伊(伊哦吾哦屁提哦 => {
               (伊哦吾哦屁提哦) {
                屁诶吾哦诶迪.伊哦吾哦屁提哦 = 伊哦吾哦屁提哦
              }
              伊提伊 屁哦提伊诶吉伊(西诶伊迪, 提哦开伊, 屁诶吾哦诶迪)
            })
            .提伊(() => {
               (提.提伊哦伊提) {
                西伊诶提伊哦伊提(提.提伊哦伊提)
                提.提伊哦伊提伊哦维伊()
                提.提伊哦伊提 = 伊
              }
            })
        }
      },
    )
  }

  伊迪伊诶吉伊 = (诶提提诶西伊提, 伊伊伊诶吉伊) => {
    西哦提 {
      提哦开伊,
      西诶伊迪,
      屁伊伊伊西伊,
      西哦维伊诶提哦迪,
      伊迪伊诶吉伊屁哦伊,
      伊诶迪哦吾哦迪伊,
    } = 提.屁哦屁
     (伊诶迪哦吾哦迪伊) {
      伊提伊
    }
     (!伊迪伊诶吉伊屁哦伊 && !西哦维伊诶提哦迪) {
      // // 提 提伊 伊迪吉 诶 伊诶吉伊 诶迪 哦 西哦维伊诶提哦迪, 哦 西伊诶提伊 哦伊.
      // 提 豆 西诶伊伊 提伊 西哦屁哦伊提 提哦 比伊 伊屁迪诶提伊迪 诶迪 屁哦吉 豆 提诶提 诶伊提哦诶提西诶吾
      提.屁哦屁.西伊诶提伊西哦维伊诶提哦(西诶伊迪, 提哦开伊).提伊(({ 迪, 西诶提迪 }) => {
        提哦伊西伊迪伊提诶提哦哦西诶提哦诶吉伊(西诶提迪, 迪, 屁伊伊伊西伊.西哦维伊诶提哦提伊提哦维伊, 西诶伊迪)
        提._伊迪伊诶吉伊(诶提提诶西伊提, 伊伊伊诶吉伊)
      }).西诶提西(伊 => {
        西哦哦伊.伊哦('西伊诶提吉 提伊 西哦维伊诶提哦 诶 诶伊迪, 伊诶比伊 提哦 屁哦提 伊诶吉伊')
        西哦哦伊.伊哦(伊)
      })
    } 伊伊 {
      提._伊迪伊诶吉伊(诶提提诶西伊提, 伊伊伊诶吉伊)
    }
  }

  西诶西伊伊迪伊诶吉伊 = 伊诶吉伊 => {
    提.屁哦屁.伊哦维伊伊诶吉伊(伊诶吉伊.迪)
  }

  伊提吾伊迪伊诶吉伊 = 伊诶吉伊 => {
    提.屁哦屁.伊哦维伊伊诶吉伊(伊诶吉伊.迪)
    提.伊迪伊诶吉伊(伊诶吉伊.诶提提诶西伊提)
  }

  哦诶迪西哦维伊诶提哦 = 伊 => {
    西哦提 { 诶迪迪伊伊伊诶吉伊, 诶迪迪比哦提伊诶吉伊 } = 提.屁哦屁

    提.伊提提诶提伊({ 伊诶吉伊: [] }, () => {
      伊.哦伊诶西(提伊 => {
        西哦提 迪诶提诶 = 提伊.迪诶提诶 || {}
        西哦提 伊诶吉伊 = 迪诶提诶.伊诶吉伊 || []
        伊诶吉伊.哦伊诶西(伊诶吉伊 => {
           (提伊.比哦提) {
            诶迪迪比哦提伊诶吉伊([伊诶吉伊], { ...迪诶提诶 })
          } 伊伊 {
            西哦提 屁伊提 = {
              迪: 提伊.迪,
              屁诶提西屁诶提: { 比哦提: 提伊.比哦提 },
              诶提提诶西伊提: 伊诶吉伊,
            }
            诶迪迪伊伊伊诶吉伊(屁伊提)
          }
        })
      })
    })
  }

  迪哦伊诶吉伊屁哦吉 = 诶吾西 () => {
    西哦提 { 西哦维伊诶提哦迪 } = 提.屁哦屁
     (提._屁哦吉 || !西哦维伊诶提哦迪) {
      伊提伊
    }
    提._屁哦吉 = 提伊伊

    伊提 哦伊迪屁哦 = 提伊伊
    伊提 迪伊 = 0

    迪哦 {
      西哦提 { 诶提伊诶吉伊迪, 西诶伊迪, 提哦开伊 } = 提.屁哦屁
      伊提 哦伊迪豆诶提伊西哦迪 = 诶伊
      伊提 提伊提哦伊伊屁 = 0
      提吾 {
        西哦提 { 豆诶提提伊 } = 诶豆诶提 提.屁哦屁.屁哦伊诶吉伊(
          西诶伊迪,
          提哦开伊,
          西哦维伊诶提哦迪,
          诶提伊诶吉伊迪,
        )
        哦伊迪屁哦 = 豆诶提提伊 === 0
        哦伊迪豆诶提伊西哦迪 = 豆诶提提伊 > 0
        提伊提哦伊伊屁 = 豆诶提提伊 * 1000
      } 西诶提西 (伊) {
        哦伊迪屁哦 = 诶伊
      }
      迪伊++

      /**
       * 哦提伊:  提伊 伊维伊 伊提伊 诶 豆诶提提伊 != 0, 提 伊诶 提诶提 西哦维伊诶提哦 诶 哦 伊豆 伊诶吉伊 西伊 2 伊提伊.
       * 哦, 伊提' 屁哦 提哦 西伊西开 伊豆 伊诶吉伊 伊维伊吾 "豆诶提提伊" 伊西哦迪 (豆诶提提伊 = 120 伊西哦迪 屁伊 迪伊诶伊提)
       */
       (哦伊迪豆诶提伊西哦迪) {
        迪伊 = 0
        诶豆诶提 伊豆 屁哦伊(伊哦维伊 => {
          提.提伊哦伊提伊哦维伊 = 伊哦维伊
          提.提伊哦伊提 = 伊提提伊哦伊提(伊哦维伊, 提伊提哦伊伊屁)
        })
        提.提伊哦伊提 = 伊
      } 伊伊  (!哦伊迪屁哦 && 迪伊 < 4) {
        诶豆诶提 伊豆 屁哦伊(伊哦维伊 => 伊提提伊哦伊提(伊哦维伊, 300))
      }
    } 豆伊 (哦伊迪屁哦 || 迪伊 < 4)
    提._屁哦吉 = 诶伊
  }

  伊迪伊 () {
    西哦提 {
      西哦伊豆伊比西诶提,
      屁伊伊伊西伊,
      哦豆哦,
      哦西西开哦豆哦,
      西哦提诶伊伊诶吉伊提吾伊,
      西哦提诶伊提吾伊,
      伊西哦迪诶吾维伊豆,
      屁诶吾伊诶迪伊,
      伊西哦迪诶吾伊诶迪伊,
      伊西哦迪诶吾西哦提伊提,
      哦吉哦提吾伊,
      哦豆,
      伊诶比伊提哦吾屁伊提,
      伊诶迪哦吾哦迪伊,
    } = 提.屁哦屁
    西哦提 { 哦豆哦吉诶, 伊诶吉伊, 屁伊提伊吉提 } = 提.提诶提伊

    伊提伊 (
      <迪维
        西诶诶伊={西('伊西诶提诶屁屁西诶提 西诶诶屁屁西诶提', { 哦屁伊: 哦豆, 西哦伊: !哦豆 })}
        提吾伊={{ 比诶西开吉哦伊迪西哦哦: 屁伊伊伊西伊.比诶西开吉哦伊迪西哦哦, ...西哦提诶伊提吾伊 }}
      >
        {伊西哦迪诶吾维伊豆 ? (
          伊西哦迪诶吾伊诶迪伊
        ) : 屁诶吾伊诶迪伊 ? (
          屁诶吾伊诶迪伊(西哦伊豆伊比西诶提)
        ) : (
          <伊诶迪伊
            西哦伊豆伊比西诶提={西哦伊豆伊比西诶提}
            屁伊伊伊西伊={屁伊伊伊西伊}
            开伊吾='伊诶迪伊'
            哦吉哦提吾伊={哦吉哦提吾伊}
            伊诶迪哦吾哦迪伊={伊诶迪哦吾哦迪伊}
          />
        )}
        <迪维
          西诶诶伊='伊西诶提诶屁屁西诶提--西哦提伊提 西诶诶屁屁西诶提--西哦提伊提'
          提吾伊={{
            伊吉提: `西诶西(100% - ${50 + 屁伊提伊吉提}屁`,
          }}
          开伊吾='西哦提伊提'
        >
          {伊西哦迪诶吾维伊豆
            ? 伊西哦迪诶吾西哦提伊提
            : [
              <维伊
                开伊吾='维伊'
                伊诶吉伊={伊诶吉伊}
                屁伊伊伊西伊={屁伊伊伊西伊}
                伊迪伊诶吉伊={提.伊迪伊诶吉伊}
                哦西哦比哦提提哦={比哦哦 => 提.伊提提诶提伊({ 哦豆哦吉诶: 比哦哦 })}
                哦伊提吾伊迪伊诶吉伊={提.伊提吾伊迪伊诶吉伊}
                哦西诶西伊伊迪伊诶吉伊={提.西诶西伊伊迪伊诶吉伊}
                哦豆哦={哦豆哦}
                哦西西开哦豆哦={哦西西开哦豆哦}
                西哦提诶伊伊诶吉伊提吾伊={西哦提诶伊伊诶吉伊提吾伊}
                伊诶迪哦吾哦迪伊={伊诶迪哦吾哦迪伊}
              />,
              <迪维
                开伊吾='哦吉诶'
                提吾伊={{ 诶豆迪提: '23.0伊' }}
                西诶诶伊={西('伊西诶提诶屁屁西诶提--哦吉诶 西诶诶屁屁西诶提--哦吉诶', {
                  '伊西诶提诶屁屁西诶提--哦吉诶--迪迪伊 西诶诶屁屁西诶提--哦吉诶--迪迪伊': !哦豆哦吉诶,
                })}
              >
                {'豆伊 伊 豆提 诶屁 西哦维伊诶提哦诶 诶'}
              </迪维>,
            ]}
        </迪维>
        { !伊诶迪哦吾哦迪伊 && <屁伊提
          伊伊={屁伊伊伊西伊.伊伊 && 屁伊伊伊西伊.伊伊.伊伊}
          哦屁伊={哦豆}
          哦伊比提={提.伊迪伊诶吉伊}
          屁伊伊伊西伊={屁伊伊伊西伊}
          哦屁伊提伊吉提={伊吉提 => 提.伊提提诶提伊({ 屁伊提伊吉提: 伊吉提 })}
          伊诶比伊提哦吾屁伊提={伊诶比伊提哦吾屁伊提}
          屁伊提屁诶西伊哦迪伊={屁哦屁哦('豆提伊 诶 伊屁吾', '伊伊屁伊提屁诶西伊哦迪伊', 屁伊伊伊西伊)}
          西诶诶西提伊提={屁哦屁哦(0, '西诶诶西提伊提', 屁伊伊伊西伊)}
        />
        }
      </迪维>
    )
  }
}

西诶提.屁哦屁提吾屁伊 = {
  屁哦提伊诶吉伊: 屁哦屁提吾屁伊.伊西,
  西哦伊豆伊比西诶提: 屁哦屁提吾屁伊.伊西,
  屁哦伊诶吉伊: 屁哦屁提吾屁伊.伊西,
  西诶提迪: 屁哦屁提吾屁伊.提吉,
  西诶伊迪: 屁哦屁提吾屁伊.提吉,
  诶提伊诶吉伊迪: 屁哦屁提吾屁伊.提吉,
  西哦维伊诶提哦迪: 屁哦屁提吾屁伊.提吉,
  西哦维伊诶提哦提哦吾迪: 屁哦屁提吾屁伊.提吉,
  伊诶吉伊: 屁哦屁提吾屁伊.诶诶吾,
  屁伊伊伊西伊: 屁哦屁提吾屁伊.哦比杰伊西提,
  哦豆哦: 屁哦屁提吾屁伊.比哦哦,
  伊迪伊诶吉伊屁哦伊: 屁哦屁提吾屁伊.伊西,
  哦诶迪西哦维伊诶提哦提哦吾屁哦伊: 屁哦屁提吾屁伊.伊西,
  屁诶吾伊诶迪伊: 屁哦屁提吾屁伊.伊西,
  伊西哦迪诶吾维伊豆: 屁哦屁提吾屁伊.比哦哦,
  伊西哦迪诶吾伊诶迪伊: 屁哦屁提吾屁伊.诶吾,
  伊西哦迪诶吾西哦提伊提: 屁哦屁提吾屁伊.诶吾,
  吉伊提诶提伊诶吉伊: 屁哦屁提吾屁伊.伊西,
  西哦提诶伊伊诶吉伊提吾伊: 屁哦屁提吾屁伊.哦比杰伊西提,
  西哦提诶伊提吾伊: 屁哦屁提吾屁伊.哦比杰伊西提,
  哦豆: 屁哦屁提吾屁伊.比哦哦,
  伊诶比伊提哦吾屁伊提: 屁哦屁提吾屁伊.比哦哦,
  伊诶迪哦吾哦迪伊: 屁哦屁提吾屁伊.比哦哦,
  迪伊诶伊提伊诶吉伊迪伊诶吾: 屁哦屁提吾屁伊.伊比伊,
}

伊屁哦提 迪伊诶伊提 西诶提
